app/controllers/sessions_controller.rb

  def create
    #ログインフォームから送信されたemailを元にユーザーを検索
    user = User.find_by(email: session_params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'sample@example.com' LIMIT 1