app/controllers/tasks_controller.rb

UPDATE `tasks` SET `tasks`.`updated_at` = '2022-04-12 06:47:19.103552' WHERE `tasks`.`id` = 22
---
  def update
    @task.update(task_params)