app/controllers/tasks_controller.rb

  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page])
---
SELECT DISTINCT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`created_at` >= '2022-03-31 15:00:00' ORDER BY `tasks`.`created_at` DESC

  def create
    #モデルのアソシエーションがかかっているからできる記述
    @task = current_user.tasks.new(task_params)

    if params[:back].present?
      render :new
      return
    end

    if @task.save
---
INSERT INTO `tasks` (`name`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('ん', '', '2022-04-06 05:34:49.097326', '2022-04-06 05:34:49.097326', 1)

  def update
    @task.update(task_params)
---
UPDATE `tasks` SET `tasks`.`description` = 'https://www.google.com/', `tasks`.`updated_at` = '2022-03-14 07:14:51.680856' WHERE `tasks`.`id` = 3

  def destroy
    @task.destroy
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 23

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 31 LIMIT 1