app/models/task.rb

INSERT INTO `tasks` (`name`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('餃子を作る', '160個作ります', '2022-04-16 05:05:52.516179', '2022-04-16 05:05:52.516179', 1)
---
      task = new
      task.attributes = row.to_hash.slice(*csv_attributes)
      task.save!